Revit 2024 API
ElectricalSetting.CircuitSequence Property
 The sequence in which power circuits are created.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public CircuitSequence CircuitSequence { get; set; }
Visual Basic
Public Property CircuitSequence As CircuitSequence
	Get
	Set
Visual C++
public:
property CircuitSequence CircuitSequence {
	CircuitSequence get ();
	void set (CircuitSequence value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace